wyniki_50G_article/fio_results_xfs_ssd/block_size_2048/lab-sec-12/fio_seq_write_article_test_output.txt
seq_write_article_test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_write_article_test: Laying out IO file (1 file / 51200MiB)

seq_write_article_test: (groupid=0, jobs=1): err= 0: pid=88534: Mon Apr 21 03:30:48 2025
  write: IOPS=3031, BW=11.8MiB/s (12.4MB/s)(2132MiB/180012msec); 0 zone resets
    slat (usec): min=3, max=148, avg=32.22, stdev=18.86
    clat (usec): min=37, max=63905, avg=293.82, stdev=1784.35
     lat (usec): min=41, max=63972, avg=326.04, stdev=1785.44
    clat percentiles (usec):
     |  1.00th=[   70],  5.00th=[   74], 10.00th=[   77], 20.00th=[   87],
     | 30.00th=[   89], 40.00th=[   91], 50.00th=[   94], 60.00th=[  129],
     | 70.00th=[  182], 80.00th=[  223], 90.00th=[  241], 95.00th=[  260],
     | 99.00th=[  359], 99.50th=[19792], 99.90th=[22414], 99.95th=[23987],
     | 99.99th=[25822]
   bw (  KiB/s): min= 3760, max=44224, per=100.00%, avg=12151.98, stdev=11018.62, samples=359
   iops        : min=  940, max=11056, avg=3037.92, stdev=2754.65, samples=359
  lat (usec)   : 50=0.02%, 100=54.65%, 250=38.13%, 500=6.38%, 750=0.04%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.35%, 50=0.42%
  lat (msec)   : 100=0.01%
  cpu          : usr=3.28%, sys=12.56%, ctx=545680, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,545677,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=11.8MiB/s (12.4MB/s), 11.8MiB/s-11.8MiB/s (12.4MB/s-12.4MB/s), io=2132MiB (2235MB), run=180012-180012msec

Disk stats (read/write):
  sdb: ios=0/545538, sectors=0/4364255, merge=0/2, ticks=0/133035, in_queue=133110, util=76.18%